"""Напишите класс, который принимает с клавиатуры целое число и выводит
на экран новое число, которое больше введенного с клавиатуры
в 10 раз."""

number = int(input('-->'))
number *= 10
print(f'увеличеное число в 10 раз = {number}')